# Data Cleaning

* **note:** In order to make any changes to this file, please copy and rename it in your local system to avoind merging conflicts.
* OG.csv used as main dataset in this notebook is orginally scrubbed.csv sourced from [here](https://www.kaggle.com/datasets/NUFORC/ufo-sightings?resource=download).

In [1]:
from datetime import datetime, timedelta
import pandas as pd

In [2]:
og_data = pd.read_csv("./Resources/OG.csv", low_memory=False)

In [3]:
og_data.head(3)

,datetime,city,state,country,shape,duration (seconds),duration (hours/min),comments,date posted,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700,45 minutes,This event took place in early fall around 194...,4/27/2004,29.8830556,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200,1-2 hrs,1949 Lackland AFB&#44 TX. Lights racing acros...,12/16/2005,29.38421,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20,20 seconds,Green/Orange circular disc over Chester&#44 En...,1/21/2008,53.2,-2.916667

In [4]:
og_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80332 entries, 0 to 80331
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   datetime              80332 non-null  object
 1   city                  80332 non-null  object
 2   state                 74535 non-null  object
 3   country               70662 non-null  object
 4   shape                 78400 non-null  object
 5   duration (seconds)    80332 non-null  object
 6   duration (hours/min)  80332 non-null  object
 7   comments              80317 non-null  object
 8   date posted           80332 non-null  object
 9   latitude              80332 non-null  object
 10  longitude             80332 non-null  float64
dtypes: float64(1), object(10)
memory usage: 6.7+ MB

In [5]:
data_not_null = og_data.dropna()

In [6]:
data_not_null = data_not_null.drop_duplicates()

In [7]:
data_not_null.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 66516 entries, 0 to 80331
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   datetime              66516 non-null  object
 1   city                  66516 non-null  object
 2   state                 66516 non-null  object
 3   country               66516 non-null  object
 4   shape                 66516 non-null  object
 5   duration (seconds)    66516 non-null  object
 6   duration (hours/min)  66516 non-null  object
 7   comments              66516 non-null  object
 8   date posted           66516 non-null  object
 9   latitude              66516 non-null  object
 10  longitude             66516 non-null  float64
dtypes: float64(1), object(10)
memory usage: 6.1+ MB

In [8]:
data = data_not_null.astype({"latitude": "float", "duration (seconds)": "float"})

In [9]:
data["duration (seconds)"] = data["duration (seconds)"].astype("int")

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 66516 entries, 0 to 80331
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   datetime              66516 non-null  object
 1   city                  66516 non-null  object
 2   state                 66516 non-null  object
 3   country               66516 non-null  object
 4   shape                 66516 non-null  object
 5   duration (seconds)    66516 non-null  int64
 6   duration (hours/min)  66516 non-null  object
 7   comments              66516 non-null  object
 8   date posted           66516 non-null  object
 9   latitude              66516 non-null  float64
 10  longitude             66516 non-null  float64
dtypes: float64(2), int64(1), object(8)
memory usage: 6.1+ MB

In [11]:
def midnight(datetime):
    """Define a function to handle the houres that are 24."""
    date, time = datetime.split(" ")
    hour, minute = time.split(":")
    if hour == "24":
        hour = "00"
    result = date + " "+ hour +":"+ minute
    return result

In [12]:
data["timestamp"] = data["datetime"].map(midnight)

In [13]:
data["timestamp"] = pd.to_datetime(data["timestamp"])

In [14]:
data["longitude"] = data["longitude "]

In [15]:
data = data[["timestamp", "duration (seconds)", "city", "state", "country", "latitude", "longitude", "shape", "comments"]]

In [16]:
data.head()

,timestamp,duration (seconds),city,state,country,latitude,longitude,shape,comments
0,1949-10-10 20:30:00,2700,san marcos,tx,us,29.883056,-97.941111,cylinder,This event took place in early fall around 194...
3,1956-10-10 21:00:00,20,edna,tx,us,28.978333,-96.645833,circle,My older brother and twin sister were leaving ...
4,1960-10-10 20:00:00,900,kaneohe,hi,us,21.418056,-157.803611,light,AS a Marine 1st Lt. flying an FJ4B fighter/att...
5,1961-10-10 19:00:00,300,bristol,tn,us,36.595000,-82.188889,sphere,My father is now 89 my brother 52 the girl wit...
7,1965-10-10 23:45:00,1200,norwalk,ct,us,41.117500,-73.408333,disk,A bright orange color changing to reddish colo...

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 66516 entries, 0 to 80331
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   timestamp           66516 non-null  datetime64[ns]
 1   duration (seconds)  66516 non-null  int64
 2   city                66516 non-null  object
 3   state               66516 non-null  object
 4   country             66516 non-null  object
 5   latitude            66516 non-null  float64
 6   longitude           66516 non-null  float64
 7   shape               66516 non-null  object
 8   comments            66516 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 5.1+ MB

In [22]:
# convert the dataframe to a json file of dict of lists
json_data = pd.io.json.dumps(data.to_dict(orient='list'))
with open("./Resources/data.json", "w") as outfile:
    outfile.write(json_data)

In [20]:
data.to_csv("./Resources/data.csv")